/**************************************************************************************
程序项目：电机转动函数
作者：Terry
日期：2019-08-13
联系方式：terryluohello@qq.com
***************************************************************************************/
#include<reg52.h>  
#include"motor.h"

void forward(void)			    // 前进函数
{
	IN1=0;
	IN2=1; // 左电机的正转
	IN3=1;
	IN4=0; // 右电机的正转
}

void back(void)			        // 后退函数
{
	IN1=1;
	IN2=0; // 左电机的反转
	IN3=0;
	IN4=1; // 右电机的反转
}

void stop(void)			        // 停止函数
{    
	IN1=0;
	IN2=0; // 左电机不动
	IN3=0;
	IN4=0; // 右电机正转
}

void turn_right(void)		    // 右转函数
{ 
	IN1=0;
	IN2=1; // 左电机的正转
	IN3=0;
	IN4=0; // 右电机不动
}

void turn_left(void)			  // 左转函数
{ 
	IN1=0;
	IN2=0; // 左电机不动
	IN3=1;
	IN4=0; // 右电机正转
}



void spin_right(void)			  // 向右打转函数
{ 
	IN1=0;
	IN2=1; // 左电机正转
	IN3=0;
	IN4=1; // 右电机反转
}

void spin_left(void)			  // 向左打转函数
{
  IN1=1;
	IN2=0; // 左电机反转
	IN3=1;
	IN4=0; // 右电机正转
}